Revit 2024 API
PipeFittingAndAccessoryConnectorData.Width Property
 The connector width, Units:(ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Width { get; }
Visual Basic
Public ReadOnly Property Width As Double
	Get
Visual C++
public:
property double Width {
	double get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace